# Split the Dataset Using Stratified K-Folds Cross-Validator

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("Data/Titanic.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.shape

(891, 12)

In [5]:
df.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [6]:
features=[i for i in df.columns if i !="Sex"]
features

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [7]:
X=np.array(df[features])
y=np.array(df["Sex"])

In [8]:
from sklearn.model_selection import StratifiedKFold
skf = StratifiedKFold(n_splits=2)
skf.get_n_splits(X, y)

2

In [9]:
for train_index, test_index in skf.split(X, y):
    X_train, X_test = X[train_index], X[test_index]
    y_train, y_test = y[train_index], y[test_index]

## Count Unique Values Using Numpy

In [10]:
unique_1, counts_1 = np.unique(y_train, return_counts=True)
print(np.asarray((unique_1, counts_1)).T)

[['female' 157]
 ['male' 289]]

In [11]:
unique_2, counts_2 = np.unique(y_test, return_counts=True)
print(np.asarray((unique_2, counts_2)).T)

[['female' 157]
 ['male' 288]]

## Count Unique Values Using Pandas

In [12]:
df_train=pd.DataFrame(X_train, columns=features)
df_test=pd.DataFrame(X_test, columns=features)
df_target_train=pd.DataFrame(y_train, columns=["Sex"])
df_target_test=pd.DataFrame(y_test, columns=["Sex"])

In [13]:
df_train.head()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",22,1,0,A/5 21171,7.25,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",26,0,0,STON/O2. 3101282,7.925,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35,1,0,113803,53.1,C123,S
4,5,0,3,"Allen, Mr. William Henry",35,0,0,373450,8.05,NaN,S

In [14]:
df_target_train.Sex.value_counts()

male      289
female    157
Name: Sex, dtype: int64

In [15]:
df_target_test.Sex.value_counts()

male      288
female    157
Name: Sex, dtype: int64